# The DataFrame and Data Structure

Creating a purchase order records as series objects for a fictional store

In [6]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                       'Item purchases': 'Dog Food',
                       'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevin',
                       'Item purchases': 'Kitty Litter',
                       'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Anshu',
                       'Item purchases': 'Bird Seed',
                       'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df.head()
# print(df)

          Name Item purchases  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevin   Kitty Litter   2.5
Store 2  Anshu      Bird Seed   5.0

In [7]:
df.loc['Store 2']

Name                  Anshu
Item purchases    Bird Seed
Cost                      5
Name: Store 2, dtype: object

In [8]:
type(df.loc['Store 2'])

pandas.core.series.Series

In [9]:
df.loc['Store 1']

          Name Item purchases  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevin   Kitty Litter   2.5

In [10]:
df.loc['Store 1', 'Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [11]:
df.T

                 Store 1       Store 1    Store 2
Name               Chris         Kevin      Anshu
Item purchases  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [13]:
df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 2       5
Name: Cost, dtype: object

In [14]:
df['Cost']

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64

In [15]:
df.loc['Store 1']['Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [16]:
df.loc[:,['Name', 'Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevin   2.5
Store 2  Anshu   5.0

`drop` is used drop any object which is given in the table

In [17]:
df.drop('Store 1')

          Name Item purchases  Cost
Store 2  Anshu      Bird Seed   5.0

In [18]:
df

          Name Item purchases  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevin   Kitty Litter   2.5
Store 2  Anshu      Bird Seed   5.0

In [19]:
copy_df = df.copy()
copy_df = copy_df.drop('Store 1')
copy_df

          Name Item purchases  Cost
Store 2  Anshu      Bird Seed   5.0

In [20]:
df

          Name Item purchases  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevin   Kitty Litter   2.5
Store 2  Anshu      Bird Seed   5.0

In [21]:
copy_df

          Name Item purchases  Cost
Store 2  Anshu      Bird Seed   5.0

In [22]:
del copy_df['Name']
copy_df

        Item purchases  Cost
Store 2      Bird Seed   5.0

In [23]:
df['Location'] = None
df

          Name Item purchases  Cost Location
Store 1  Chris       Dog Food  22.5     None
Store 1  Kevin   Kitty Litter   2.5     None
Store 2  Anshu      Bird Seed   5.0     None